{"basics":{"name":"Kaushiki Ghosh Hazra","label":"Senior Quality Assurance Analyst","image":"","email":"kaushikighoshhazra2@gmail.com","phone":"(32) 490442328","url":"https://hazra277.github.io","summary":"Senior Quality Assurance Analyst with over 7 years of experience in testing and automation across multiple domains, including telecommunications, web applications, mobile platforms, and SAP systems. Expertise in designing and executing comprehensive test strategies, developing automation frameworks, and performing cross-platform testing to enhance system performance and reliability. Proven ability to lead QA activities, collaborate with cross-functional teams, and implement continuous integration pipelines, resulting in significant reductions in defects and improvements in operational efficiency.","location":{"address":"","postalCode":"","city":"","countryCode":"","region":""},"profiles":[]},"work":[{"name":"Cognizant","position":"Senior Test Analyst | Quality Assurance","startDate":"2022-01-01","endDate":"","summary":"Leading quality assurance activities for telecommunications and enterprise applications, with focus on automation and performance monitoring.","highlights":["Led quality assurance activities for large-scale telecom partners like Colruyt, Carrefour, and Decathlon","Tested applications including various end-user flows like voice and data after security patching and hotfixes","Conducted daily checks of applications using Dynatrace, maintaining optimal performance and availability","Set up requirements for alarm checks in Dynatrace, improving incident detection and response times by 25%","Produced detailed analysis reports of billing Call Detail Records (CDRs), thresholds, and counters","Led QA efforts for replatforming project, replacing old servers of VoIP data components with zero end-user defects","Led QA activities for 5G SA rollout, conducting E2E integration and testing across various mobile devices","Automated application-ready utilities for environment test setup, stability, and security checks, improving test readiness by 35%","Created and executed test scripts for various environments and checks post-OS patching and certificate updates"]},{"name":"TCS","position":"QA Analyst | Automation","startDate":"2016-01-01","endDate":"2018-12-31","summary":"Focused on automation and SAP testing, ensuring quality across multiple testing phases.","highlights":["Automated key aspects of testing such as environment setup, stability checks, and test data creation, enhancing efficiency by 35%","Conducted daily checks of automation regression suites, optimized scripts, and managed Jenkins jobs","Successfully tested master data in SAP MM, ensuring 98% data accuracy","Planned and designed scenarios for Unit Tests, Integration Tests, Mobile Tests, and User Acceptance Testing","Contributed to 15% reduction in post-deployment defects through early detection","Analyzed design specifications and internal system structures to produce detailed test solutions"]}],"education":[{"institution":"West Bengal University","location":"India","area":"Technology","studyType":"Bachelor's","startDate":"2012-01-01","endDate":"2016-01-01"}],"skills":[{"name":"Testing Frameworks & Methodologies","keywords":["TDD","BDD","Page Object Model","Functional Testing","Regression Testing","Performance Testing","Load Testing","Unit Testing","Integration Testing","UAT","End-to-End Testing"]},{"name":"Automation & CI/CD Tools","keywords":["Jenkins","ReadyAPI","TOSCA","Automation Script Development","Continuous Integration","Continuous Deployment"]},{"name":"Application Monitoring & Performance","keywords":["Dynatrace","Performance Benchmarking","CDR Analysis"]},{"name":"Cross-Platform Testing","keywords":["iOS","Android","SOAP","REST APIs","SAP MM","SAP RS"]},{"name":"Telecommunications","keywords":["ARTillium","SS7","Diameter","SIGTRAN","SIP","2G","3G","4G/LTE","5G","IMS Architecture","VoLTE","VoWiFi"]},{"name":"Test Data Management","keywords":["Test Data Creation","Data Load Migrations","Data Integrity"]}],"languages":[{"language":"English","fluency":"Fluent"}],"certificates":[],"interests":[],"references":[],"projects":[]}